
1)
παίρνεις ένα string (δεν ξέρω πως, από κονσόλα ή data), έστω το ''abcd'' και εκτυπώνεις το εξης: *bcd a*cd ab*d abc*

--
2)
Να βρείτε για ένα ακέραιο αριθμό μεγαλύτερο του μηδενός που θα διαβάσετε από το πληκτρολόγιο αν είναι πολλαπλάσιο του 16, χωρίς να χρησιμοποιήσετε την πράξη της διαίρεσης του MIPS .

--
3)
Να αλλάζει ένα string αποθηκευμένο στο .data, κάνοντας το rotate left ή right. Κι αυτό ατέρμονα (abcd - bcda - cdab - dabc - abcd klp)

--
4)
Να διαβάζει από την κονσόλα έναν αριθμό κάθε φορά (ατέρμονα), και να καταγράφει πόσοι θετικοί έχουν δοθεί ως τώρα. Να εκτυπώνει αν δοθεί το 0. 

--
5)
Να διαβάζει από την κονσόλα έναν αριθμό κάθε φορά (ατέρμονα), και να εκτυπώνει τον αντίστοιχο χαρακτήρα ενός string 20 χαρακτήρων που έχεις αποθηκευμένο στο .data. πχ αν έχω το abcdefghijklmnopqrst, και μου δοθεί το 5, εκτυπώνεται το "e". Aν δοθεί το 0 το πρόγραμμα να τερματίζει.

--
6)
Να διαβαζει επαναληπτικα ακεραιους και να βρισκει εαν ειναι πρωτος ή οχι. Να εκτυπωνει αναλογο μηνυμα. Το προγραμμα τελειωνει οταν δοθει σαν αριθμος το 0.(σημείωση: μπορούμε να ελέγχουμε αν ειναι πρώτος με όποιον τρόπο θέλουμε)

--
7)
Να γράψετε ένα πρόγραμμα στο οποίο αν θα εισάγουμε τον χαρακτήρα 'a' θα μας εμφανίζει μια συμβολοσειρά (στο τμήμα data), η οποία έχει κεφαλαία ΚΑΙ μικρά μέσα, μόνο με μικρά, ενώ αν εισάγουμε τον χαρακτήρα 'A', θα την εμφανίζει μόνο με κεφαλαία.

--
8)
Να έχεις ένα string 10 χαρακτήρων στο data (πχ abcdefghijk) και να πρεπει να εκτυπώνει τον πρώτο με τον τελευταίο, μετά δέυτερο με τον προτελευταίο κοκ, με κενά ανάμεσα τους, δηλαδη να σχιματίζει κατι σαν πυραμίδα, και μετά το αντίστροφο (δλδ και την αναποδη πυραμίδα)

--
9)κάτι συνέβη στο 9 κατά την επικόλληση από το κινητό

10)
Να έχεις ένα string στο τμήμα data (πχ abcdefghij) και να βαζεις σαν input έναν αριθμό (1-4) και να σου βγάζει output πχ για 2:aabbccdd..., για 3:aaabbbcccddd... κλπ, χωρίς κάποια συνθήκη για να τερματίζει, δλδ ατέρμονα loop

--
11)
Τον Ιούνιο του 2016 ζητήθηκε σε μία ομάδα η μετατροπή ενός string 20 character long ως εξής:
aaaaaaaaaaaaaaaaaaaa
.aaaaaaaaaaaaaaaaaaa
a.aaaaaaaaaaaaaaaaaa
aa.aaaaaaaaaaaaaaaaa
aaa.aaaaaaaaaaaaaaaa
...
aaaaaaaaaaaaaaaaaaa.
Επίσης χωρίς τερματισμό

--
12)
Έδινε ένα string της μορφής abcdefgh και ήθελε ατέρμονα να εμφανίζει στην κονσόλα

bcdefgha

cdefghab

κλπ